Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Прибыль</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ЦенаРеализацииНоменклатурыНаСервере(Номенклатура)
	
	Возврат ПолучениеДанныхНаСервере.ЦенаНоменклатурыНаСервере(Номенклатура, Объект.ВидЦены, Объект.Дата); 
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличнойЧастиКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
	Объект.СуммаПоДокументу = Объект.Товары.Итог("Стоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаРеализацииПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличнойЧастиКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
	Объект.СуммаПоДокументу = Объект.Товары.Итог("Стоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Если Объект.Валюта = ПредопределенноеЗначение("Справочник.Валюты.Рубль") ИЛИ НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
			ТекСтрока.Цена = ЦенаРеализацииНоменклатурыНаСервере(ТекСтрока.Номенклатура);
			ОбработкаТабличнойЧастиКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
			Объект.СуммаПоДокументу = Объект.Товары.Итог("Стоимость");
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
	
	ПарамерыФормы = Новый Структура;
	ПарамерыФормы.Вставить("СкладПараметр", Объект.Склад);
	ПарамерыФормы.Вставить("ВидЦеныПараметр", Объект.ВидЦены);
	ПарамерыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПарамерыФормы.Вставить("МножественныйВыбор", Истина);
	ПарамерыФормы.Вставить("АдресВХ", ПоместитьТЧТоварыВВременноеХранилище());
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", ПарамерыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТЧТоварыВВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить());
	
КонецФункции 

&НаКлиенте
Процедура ОбработатьПодбор(АдресВХ) Экспорт

	ОбработатьПодборНаСервере(АдресВХ);
	Объект.СуммаПоДокументу = Объект.Товары.Итог("Стоимость");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборНаСервере(АдресВХ) 

	Объект.Товары.Загрузить(ПолучитьИзВременногоХранилища(АдресВХ));
	
КонецПроцедуры
